<template>
  <h4>자주 이용되는 주요 컴포넌트 소개</h4>
  <ul class="list">
    <li>
      QBadge (뱃지): 요소 위에 작은 뱃지를 표시하여 알림이나 카운트, 속성 등을
      표시하는 데 사용됩니다.
    </li>
    <li>
      QBtn (버튼): 애플리케이션의 다양한 상황에서 사용되는 버튼을 생성할 때
      사용합니다. 다양한 스타일 및 기능을 지원합니다.
    </li>
    <li>
      QInput (입력 필드): 텍스트 입력, 비밀번호 입력, 이메일 입력 등 다양한 입력
      필드를 생성할 때 사용합니다.
    </li>
    <li>
      QSelect (셀렉트 박스): 드롭다운 목록을 생성하고 선택할 수 있는 옵션을
      표시할 때 사용합니다.
    </li>
    <li>
      QCheckbox (체크박스) 및 QRadio (라디오 버튼): 사용자에게 선택 옵션을
      제공하고 선택한 항목을 처리할 때 사용합니다.
    </li>
    <li>
      QTable (테이블): 데이터를 표 형식으로 표시하고 정렬, 필터링 및
      페이지네이션 기능을 제공할 때 사용합니다.
    </li>
    <li>
      QDialog (alert/confirm): 모달 대화 상자를 생성하고 사용자와의 상호 작용을
      위해 사용됩니다.
    </li>
    <li>
      QNotify (토스트 메세지): 알림 및 통지 메시지 컴포넌트입니다. 이 컴포넌트를
      사용하면 사용자에게 다양한 유형의 알림을 표시하고 상호 작용할 수 있습니다.
    </li>
    <li>
      QTabs (탭): 다중 탭을 사용하여 다양한 섹션을 표시하고 탭 간에 전환할 때
      사용합니다.
    </li>
    <li>
      QAvatar (아바타): 프로필 이미지 또는 사용자 정보에 연결된 이미지를
      표시하는 데 사용됩니다.
    </li>
    <li>
      QIcon (아이콘): 아이콘을 표시하고 사용자 인터페이스를 미적으로 향상시키는
      데 사용됩니다.
    </li>
    <li>
      QCard (카드): 정보를 블록 레이아웃으로 표시하고 카드 단위로 묶을 때
      사용됩니다.
    </li>
    <li>
      QList (리스트): 리스트 항목을 나열하고 사용자에게 정보를 제공하는 데
      사용됩니다.
    </li>
    <li>
      QTooltip (툴팁): 요소에 대한 설명을 제공하고 사용자에게 정보를 표시하는 데
      사용됩니다.
    </li>
    <li>QMenu (메뉴): 드롭다운 메뉴 또는 팝업 메뉴를 생성할 때 사용됩니다.</li>
    <li>
      QBanner (배너): 공지사항이나 알림을 표시하는 데 사용되며, 애플리케이션
      상단에 배너를 표시합니다.
    </li>
  </ul>
</template>
<script lang="ts" setup></script>
