<template>
  <div>
    <h4>퀘이사의 장점</h4>
    <ul class="list">
      <li>
        <mark>Vue.js 기반이다</mark>: Vue.js는 학습 곡선이 낮고 사용하기 쉬운
        프레임워크이며, Quasar는 이를 기반으로 확장하므로 Vue.js에 익숙한
        개발자들이 쉽게 적응할 수 있습니다.
      </li>
      <li>
        <mark>다양한 플랫폼을 소스코드 하나로 지원한다</mark>: Quasar는
        <mark
          >웹 브라우저, PWA, iOS, Android 그리고 Windows, Mac 애플리케이션</mark
        >
        등 다양한 플랫폼에서 동작하는 애플리케이션을 개발할 수 있습니다. 이는
        코드를 공유하고 다양한 플랫폼에 대한 애플리케이션을 구축하는 데 큰
        장점을 제공합니다.
      </li>
      <li>
        <mark>풍부한 반응형 디자인 UI 컴포넌트</mark>: Quasar는 실무에 필요한
        대다수의 UI 컴포넌트를 가지고 있으며, 샘플코드를 제공합니다. 미리
        디자인된 다양한 UI 컴포넌트를 제공하여 개발자가 빠르게 프로토타입을
        작성하고 일관된 디자인을 유지할 수 있도록 도와줍니다. 또한 모든
        컴포넌트가 반응형 디자인을 지원하여
        <mark>모바일 기기와 데스크톱 화면에 맞게 자동으로 조절</mark>됩니다.
      </li>
      <li>
        <mark>SSR (서버 사이드 렌더링) 지원</mark>: Quasar는 서버 사이드
        렌더링을 지원하여
        <mark>검색 엔진 최적화(SEO) 및 초기 로딩 성능 향상</mark>을 제공합니다.
      </li>
    </ul>
    <h4>퀘이사 프레임워크의 단점</h4>
    <ul class="list">
      <li>
        <mark>러닝커브</mark>: 모든 프레임워크가 그렇겠지만 Quasar Framework의
        다양한 기능을 익히는 데 시간이 걸릴 수 있으며, 컴포넌트가 필요할 때
        Documents를 참고하기 위해 자주 사이트에 방문해야 합니다. 또한 Vue.js에
        대한 기초적인 이해가 필요합니다.
      </li>
      <li>
        <mark>번들 크기</mark>: 내장된 컴포넌트가 풍부한 만큼 많은 리소스 공간을
        차지합니다. Quasar Framework는 번들 크기가 큰 경우가 있어 초기 로딩
        속도에 영향을 미칠 수 있습니다. 코드 분할과 최적화를 통해 이 문제를
        완화할 수 있습니다.
      </li>
    </ul>
    <h4>Q. 퀘이사로 빌드 된 앱은 네이티브앱인가 웹앱인가?</h4>
    <ul class="list">
      <li>
        Quasar가 하나의 소스코드로 IOS, Android 어플리케이션을 빌드할 수 있는
        이유는, Apache Cordova를 사용하기 때문입니다. 코르도바는 Nitobi가 만들고
        어도비 시스템즈가 인수한 모바일 개발 프레임워크입니다.
      </li>
      <li>
        Quasar가 Windows 및 Mac 어플리케이션을 어플리케이션을 빌드할 수 있는
        이유는, Electron을 사용하기 때문입니다. 일렉트론은 웹 프로젝트를
        데스크탑의 응용프로그램으로 빌드합니다.
      </li>
      <li>
        위에 말한 두가지 프레임워크 모두, 소프트웨어 프로그래머들이 기기에
        특화된 언어들 대신 자바스크립트, HTML5, CSS3를 이용하여 모바일 기기를
        위한 응용 프로그램들을 만들 수 있게 합니다. 하지만
        <mark>응용 프로그램 결과물들은 하이브리드 형태</mark>인데, 이는 모든
        레이아웃 렌더링이 플랫폼의
        <mark>네이티브 UI 프레임워크가 아닌 웹 뷰를 통해 수행</mark>되며 단지
        웹앱일 뿐만 아니라 배포를 위해 패키지화되면서 네이티브 기기 API에 접근할
        수 있음을 의미합니다.
      </li>
      <li>
        따라서 프로젝트의 목표와 요구 사항(앱 리소스를 스토어에서 업데이트
        해야하는 프로젝트 등)에 따라 Quasar를 선택하면 효율적으로 멀티플랫폼
        애플리케이션을 개발하고 배포할 수 있으며, 개발자들은
        <mark>익숙한 웹 기술을 활용하여 더 쉽게 개발</mark>할 수 있습니다.
      </li>
    </ul>
  </div>
</template>
<script lang="ts" setup></script>
