<template>
  <div>
    <h4>왜 퀘이사를 선택하는가?</h4>
    <ul class="list">
      <li>
        <mark>Material 가이드라인을 따르는 UI를 제공합니다</mark>: 구글의 디자인
        가이드인 머티리얼 디자인은, 질감이 느껴지는 표면 (tactile surfaces) 과
        대담하고 선명한 그래픽 디자인 (bold graphic design), 그리고 아름답고
        직관적인 사용자 경험을 위한 자연스러운 애니메이션을 특징으로 합니다.
        머티리얼 디자인에서 표면과 그림자는 물리적인 구조를 형성하여, 사용자들이
        화면 상의 어떤 부분을 터치할 수 있고 움직일 수 있는지 쉽게 이해할 수
        있도록 돕습니다. 현대적인 출판물 디자인 원칙이 반영되어 다른 부가
        요소보다 컨텐츠 자체가 강조됩니다. 모든 움직임에는 의미가 있으며, 화면
        요소들 간의 관계를 명확히 하고 세세한 디테일을 통해 사용자에게 이러한
        관계를 알려 줍니다. 이는 사용자경험(UX)과 직결됩니다.
      </li>
      <li>
        <mark>자동 트리셰이크</mark>: 빌드 프로세스 중에 도구나 컴파일러가
        프로젝트의 모든 코드를 분석합니다. 분석 단계에서 사용되지 않는 코드를
        식별합니다. 이는 프로젝트에서 실제로 호출되지 않는 함수, 클래스, 변수
        등을 의미합니다. 사용되지 않는 코드가 식별되면, 이 코드를 번들에서
        완전히 제거하고 번들 크기를 줄입니다. 트리 셰이크는 웹 애플리케이션을
        최적화하고 사용자가 더 빠르게 로드하고 실행할 수 있도록 도와줍니다. 특히
        대규모 자바스크립트 프로젝트에서 중요하며, 프로젝트의 크기가 커질수록
        번들 크기를 최소화하여 초기 로딩 시간을 단축하는 데 도움이 됩니다.
      </li>
      <li>
        <mark>업데이트가 꾸준한 프레임워크</mark>: 새로운 기능을 포함한 정기적인
        릴리스 주기를 가지고 있습니다.
      </li>
      <li>
        <mark>프레임워크 개발자와 직접 소통 가능한 커뮤니티</mark>: 디스코드
        채팅을 통해 퀘이사 개발팀 및 많은 퀘이사 이용 유저와 의견 및 이슈에 대해
        의견을 나눌 수 있습니다. (<a
          href="https://discord.com/invite/5TDhbDg"
          target="_blank"
          >https://discord.com/invite/5TDhbDg</a
        >) : 2023-09-06 기준 참여자 20,000명
      </li>
    </ul>
  </div>
</template>
<script lang="ts" setup></script>
